Revit 2027 API
BuiltInFailures.InfillFailures.InfillCannotHaveDiffThickness Property
 This infilling element must have the same thickness as its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InfillCannotHaveDiffThickness { get; }
Public Shared ReadOnly Property InfillCannotHaveDiffThickness As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InfillCannotHaveDiffThickness {
	FailureDefinitionId^ get ();
}
static member InfillCannotHaveDiffThickness : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace